DeviceProcessEvents
  | where InitiatingProcessParentFileName in~("svchost.exe", "taskeng.exe") and InitiatingProcessFileName == "cmd.exe" and InitiatingProcessCommandLine has_all (@"Windows\Temp", ">", "2>&1")

// Description: Identifies known indicators of Atexec.py after execution.
//  https://tools.thehacker.recipes/impacket/examples/atexec.py
// https://github.com/fortra/impacket/tree/master
