DeviceProcessEvents
  | where FileName == "reg.exe"
  | where ProcessCommandLine has_all('save','hklm') and ProcessCommandLine has_any("security", "sam", "system")

// Description: Detects attempts to access and save registry locations that contain credentials. This can be an indicators of open source tools like LaZagne.
